
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST-V15
  * module.db-v11.azurerm_postgresql_server.postgres-paas
* Replace
  * module.db-v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.db-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.db-v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;evidence&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST-V15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V15" {
        id                      = "https://dm-aat.vault.azure.net/secrets/store-POSTGRES-HOST-V15/f49623dca32b44e197a74a65f6667941"
        name                    = "store-POSTGRES-HOST-V15"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.db-v11.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-store-postgres-db-v11-data-aat/providers/Microsoft.DBforPostgreSQL/servers/dm-store-postgres-db-v11-aat"
        name                              = "dm-store-postgres-db-v11-aat"
        tags                              = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/document-management-store-app.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.db-v15.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" # forces replacement
      ~ fqdn                          = "dm-store-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-store-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dm-store-postgres-db-v15-aat" -> (known after apply)
        name                          = "dm-store-postgres-db-v15-aat"
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/document-management-store-app.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
      - zone                          = "2" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.db-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-store-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dm-store-postgres-db-v15-aat/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-store-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dm-store-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.db-v15.azurerm_postgresql_flexible_server_database.pg_databases["evidence"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-store-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dm-store-postgres-db-v15-aat/databases/evidence" -> (known after apply)
        name      = "evidence"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-store-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dm-store-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2016,"Program":"tfcmt","SHA1":"","Vars":{}} -->